import random
from http import HTTPStatus
from dashscope import Generation

# 设置您的API密钥
API_KEY = 'sk-16aa6d09b6ba46699e842d5dbc89ba50'

def multi_round_conversation():

    messages = [
        {
            "role": "system",
            "content": "你是一个不会自作主张的只能机器人，仅对对话中的文本进行'指代消替'和'内容补全'，如果无需指代消替和内容补全则原文回答即可；比如提问'你是傻子'，如果不涉及指代消替，直接回答'你是傻子'"
        },

        {
            "role": "user",
            "content": "我的同学张三，他养了两只大金毛波妞和花花，它们经常跟着一起去食堂，食堂的阿姨也很喜欢它们，所以他常常以此为豪，时不时地就对食堂的阿姨们说：你们真老登"
        },
        {
            "role": "assistant",
            "content": """
                {
                    '输入': '我的同学张三，他养了两只大金毛波妞和花花，它们经常跟着一起去食堂，食堂的阿姨也很喜欢它们，所以他常常以此为豪，时不时地就对食堂的阿姨们说：你们真老登',
                    '分词和词性标注': '[我的/r] [同学/n] [张三/nr] [，/w] [他/r] [养/v] [了/u] [两只/m] [大/a] [金毛/nz] [波妞/nz] [和/c] [花花/nz] [，/w] [它们/r] [经常/d] [跟着/p] [一起/d] [去/v] [食堂/n] [，/w] [食堂/n] [的/u] [阿姨/n] [也/d] [很/d] [喜欢/v] [它们/r] [，/w] [所以/c] [他/r] [常常/d] [以/p] [此/r] [为/p] [豪/n] [，/w] [时不时/d] [地/uv] [就/d] [对/p] [食堂/n] [的/u] [阿姨们/n] [说/v] [：/w] [你们/rr] [真/d] [老登/a] [。/w]',
                    '命名实体': '[我的/O] [同学/O] [张三/person] [，/O] [他/O] [养/O] [了/O] [两只/O] [大金毛波妞/animal] [和/O] [花花/animal] [，/O] [它们/O] [经常/O] [跟着/O] [一起/O] [去/O] [食堂/O] [，/O] [食堂/O] [的/O] [阿姨/O] [也/O] [很/O] [喜欢/O] [它们/O] [，/O] [所以/O] [他/O] [常常/O] [以此/O] [为/O] [豪/O] [，/O] [时不时/O] [地/O] [就/O] [对/O] [食堂/O] [的/O] [阿姨/O] [们/O] [说/O] [：/O] [你们/O] [真/O] [老登/O] [。/O]',
                    '依存句法分析': '代词[他]与先行词[张三]之间存在着指代关系,代词[它们]与先行词[大金毛波妞]、[花花]之间存在着指代关系,代词[你们]与先行词[阿姨]之间存在着指代关系',
                    '代词识别': '人称代词[他]、[它们]、[你们]',
                    '先行词识别': '先行词[张三]、[大金毛波妞]、[花花]、[阿姨们]',
                    '指代消解': '替换人称代词[他]为先行词[张三]，替换人称代词[它们]为先行词[大金毛波妞]、[花花]，替换人称代词[你们]为先行词[阿姨们]',
                    '输出': '我的同学张三，张三养了两只大金毛波妞和花花，大金毛波妞、花花经常跟着一起去食堂，食堂的阿姨也很喜欢大金毛波妞、花花，所以张三常常以此为豪，时不时地就对食堂的阿姨们说：阿姨们真老登'
                }
            """
        },

        {
            "role": "user",
            "content": "我和我的好朋友小明经常一起在操场踢足球，他总是射门很准，因此我们的队伍常常赢得比赛。"
        },
        {
            "role": "assistant",
            "content": """
                {
                    '输入': '我和我的好朋友小明经常一起在操场踢足球，他总是射门很准，因此我们的队伍常常赢得比赛。',
                    '分词和词性标注': '[我/r] [和/c] [我/r] [的/u] [好/a] [朋友/n] [小明/nr] [经常/d] [一起/d] [在/p] [操场/n] [踢/v] [足球/n] [，/w] [他/r] [总是/d] [射门/n] [很/d] [准/a] [，/w] [因此/c] [我们/r] [的/u] [队伍/n] [常常/d] [赢得/v] [比赛/v] [。/w]',
                    '命名实体': '[我/O] [和/O] [我/O] [的/O] [好/O] [朋友/O] [小明/person] [经常/O] [一起/O] [在/O] [操场/O] [踢足球/O] [，/O] [他/O] [总是/O] [射门/O] [很/O] [准/O] [，/O] [因此/O] [我们/O] [的/O] [队伍/O] [常常/O] [赢得/O] [比赛/O] [。/O]',
                    '依存句法分析': '代词[他]与先行词[小明]之间存在着指代关系',
                    '代词识别': '人称代词[他]',
                    '先行词识别': '先行词[小明]',
                    '指代消解': '替换人称代词[他]为先行词[小明]',
                    '输出': '我和我的好朋友小明经常一起在操场踢足球，小明总是射门很准，因此我们的队伍常常赢得比赛。'
                }
            """
        },

        {
            "role": "user",
            "content": "校园里有一个小卖部，我每天都会去那里买饮料，老板娘很热情，她总是微笑着为我服务。"
        },
        {
            "role": "assistant",
            "content": """
                {
                    '输入': '校园里有一个小卖部，我每天都会去那里买饮料，老板娘很热情，她总是微笑着为我服务。',
                    '分词和词性标注': '[校园/n] [里/f] [有/v] [一个/m] [小卖部/n] [，/w] [我/r] [每天/r] [都/d] [会/v] [去/v] [那里/r] [买/v] [饮料/n] [，/w] [老板娘/n] [很/d] [热情/a] [，/w] [她/r] [总是/d] [微笑/v] [着/u] [为/p] [我/r] [服务/v] [。/w]',
                    '命名实体': '[校园/O] [里/O] [有/O] [一个/O] [小卖部/O] [，/O] [我/O] [每天/O] [都/O] [会/O] [去/O] [那里/O] [买/O] [饮料/O] [，/O] [老板娘/O] [很/O] [热情/O] [，/O] [她/O] [总是/O] [微笑/O] [着/O] [为/O] [我/O] [服务/O] [。/O]',
                    '依存句法分析': '代词[她]与先行词[老板娘]之间存在着指代关系',
                    '代词识别': '人称代词[她]',
                    '先行词识别': '先行词[老板娘]',
                    '指代消解': '替换人称代词[她]为先行词[老板娘]',
                    '输出': '校园里有一个小卖部，我每天都会去那里买饮料，小卖部的老板娘很热情，老板娘总是微笑着为我服务。'
                }
            """
        },

        {
            "role": "user",
            "content": "我是陈总，他是张三，找找他的号码信息"
        },
        {
            "role": "assistant",
            "content": """
                {
                    '输入': '我是陈总，他是张三，找找他的号码信息',
                    '分词和词性标注': '[我/r] [是/v] [陈总/nr] [，/w] [他/r] [是/v] [张三/nr] [，/w] [找/v] [找/v] [他/r] [的/u] [号码/n] [信息/n]',
                    '命名实体': '[我/O] [是/O] [陈总/person] [，/O] [他/O] [是/O] [张三/person] [，/O] [找/v] [找/v] [他/O] [的/O] [号码/n] [信息/n]',
                    '依存句法分析': '代词[他]与先行词[张三]之间存在着指代关系',
                    '代词识别': '人称代词[他]',
                    '先行词识别': '先行词[张三]',
                    '指代消解': '替换人称代词[他]为先行词[张三]',
                    '输出': '我是陈总，他是张三，找找张三的号码信息'
                }
            """
        }
    ]


    while True:
        user_content = input("用户输入：").strip()
        if user_content:
            messages.append({"role": "user", "content": user_content})

            response = Generation.call(
                'qwen-14b-chat',
                # 'qwen-plus',
                api_key=API_KEY,
                messages=messages,
                seed=random.randint(1, 10000),
                result_format='message'
            )

            if response.status_code == HTTPStatus.OK:
                #print(response)
                # 获取 content 的值
                content_value = response['output']['choices'][0]['message']['content']
                print("模型输出：" + content_value)

                messages.append({'role': response.output.choices[0]['message']['role'],
                                 'content': response.output.choices[0]['message']['content']})
            else:
                print('请求ID：%s，状态码：%s，错误码：%s，错误消息：%s' % (
                    response.request_id, response.status_code,
                    response.code, response.message
                ))

if __name__ == '__main__':
    multi_round_conversation()
